<?php

/**
 * все що може змінюватися в майбутьому чи при перенесенні веб-додатка
 * на інші сервери - КОНФІГУРУЄМО
 * і задаємо через константи
 */
define('VIEWS_PATH', __DIR__.'/../views/');

/**
 * директорія, в якій будуть знаходитися файли-контролери
 * або іншими словами, код хендлерів, обробників різноманітних подій, ситуацій */ 
define('CONTROLLERS_PATH', __DIR__.'/../controllers/');

/**
 * синтаксично все вірно
 * але, якщо я захочу локалізувати ці данні, наприклад для укр. мови
 * і щоб локалізація вмикалася автоматично, в залежності від налаштувань браузера користувача
 * 
 * Залишаю це для зворотньої сумісності і інформативності.
 */
define('ARRAY_MONTH', ['1' => 'January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']);

// тут все ок
define('ARRAY_VOWELS', ['a', 'e', 'i', 'o', 'u']);
